"""
Общие константы для бота
"""

# Настройки канала
CHANNEL_ID = -1002680464877
CHANNEL_USERNAME = "@legal_stars"
CHANNEL_LINK = "https://t.me/legal_stars"

# Настройки канала отзывов
REVIEWS_CHANNEL = "@otzivistarslegal"
REVIEW_CHANNEL_ID = -1002459965266

# Фиксированные цены на премиум
PREMIUM_FIXED_PRICES = {
    '3m': 1154,  # 3 месяца
    '6m': 1580,  # 6 месяцев
    '12m': 2600  # 12 месяцев
}

# Настройки звезд
STARS_PRICES = {
    '50': 50,
    '100': 100,
    '250': 250,
    '500': 500,
    '1000': 1000,
    '2500': 2500
}

# Настройки криптовалют
CRYPTO_PRICES = {
    'BTC': {
        '0.001': 0.001,
        '0.005': 0.005,
        '0.01': 0.01,
        '0.05': 0.05,
        '0.1': 0.1
    },
    'ETH': {
        '0.01': 0.01,
        '0.05': 0.05,
        '0.1': 0.1,
        '0.5': 0.5,
        '1': 1.0
    },
    'USDT': {
        '10': 10,
        '50': 50,
        '100': 100,
        '500': 500,
        '1000': 1000
    },
    'TON': {
        '1': 1,
        '5': 5,
        '10': 10,
        '50': 50,
        '100': 100
    }
}
